libretiny-eu/libretiny/boards/cb2s/variant.h
/* This file was auto-generated from cb2s.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         11
#define NUM_DIGITAL_PINS   11
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 3u     // GPIO23
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 1
#define PIN_WIRE2_SCL         8u // GPIO0
#define PIN_WIRE2_SDA         9u // GPIO1

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 2
#define PIN_SERIAL1_RX          4u // GPIO10
#define PIN_SERIAL1_TX          5u // GPIO11
#define PIN_SERIAL2_RX          9u // GPIO1
#define PIN_SERIAL2_TX          8u // GPIO0
